ЛИС2/src/Catalogs/Коэффициенты/Коэффициенты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Коэффициенты</name>
  <comment>В справочнике содержится информация, которая совсем не изменяется или изменяется достаточно редко.</comment>
  <predefined>
    <items>
      <name>удалитьДополнительныйКоэффициент12</name>
      <description>Дополнительный коэффициент 1,2</description>
    </items>
    <items>
      <name>удалитьДополнительныйКоэффициент2</name>
      <description>Дополнительный коэффициент 2</description>
    </items>
    <items>
      <name>ДополнительныйКоэффициентК</name>
      <description>Дополнительный коэффициент К</description>
    </items>
    <items>
      <name>КоэффициентНормативаЛимит</name>
      <description>Коэфициент к нормативу платы в пределах установленного лимита</description>
    </items>
    <items>
      <name>КоэффициентНормативаЛимитВода</name>
      <description>Коэфициент к нормативу платы в пределах установленного лимита (Вода)</description>
    </items>
    <items>
      <name>КоэффициентНормативаЛимитВоздух</name>
      <description>Коэфициент к нормативу платы в пределах установленного лимита (Воздух)</description>
    </items>
    <items>
      <name>КоэффициентВзвешенныхВеществ</name>
      <description>Коэффициент для взвешенных веществ (вода)</description>
    </items>
    <items>
      <name>КоэффициентЗахороненияОтходов</name>
      <description>Коэффициент захоронения отходов на собственных площадках</description>
    </items>
    <items>
      <name>КоэффициентНормативаРазмещенияЛимит</name>
      <description>Коэффициент к нормативу платы за размещение отходов в пределах установленного лимита (отходы)</description>
    </items>
    <items>
      <name>КоэффициентКСтавкеПлатыЗаВыбросВСВ</name>
      <description>Коэффициент к ставке платы за выброс в пределах ВСВ, (Квр)</description>
    </items>
    <items>
      <name>КоэффициентКСтавкеПлатыЗаВыбросСверхлимит</name>
      <description>Коэффициент к ставке платы за выброс сверхлимит, (Кср)</description>
    </items>
    <items>
      <name>КоэффициентКСтавкеПлатыЗаОтходыСверхлимит</name>
      <description>Коэффициент к ставке платы за отходы, размещенные сверх лимита, (Ксл)</description>
    </items>
    <items>
      <name>КоэффициентКСтавкеПлатыЗаСбросВСС</name>
      <description>Коэффициент к ставке платы за сброс в пределах ВСС, (Квр)</description>
    </items>
    <items>
      <name>КоэффициентКСтавкеПлатыЗаСбросСверхлимит</name>
      <description>Коэффициент к ставке платы за сброс сверхлимит, (Кср)</description>
    </items>
    <items>
      <name>КоэффициентМестаРазмещения</name>
      <description>Коэффициент места расположения объекта размещения отходов</description>
    </items>
    <items>
      <name>КоэффициентЭкологическойЗначимостиВода</name>
      <description>Коэффициент экологической значимости (вода)</description>
    </items>
    <items>
      <name>КоэффициентЭкологическойЗначимостиВоздух</name>
      <description>Коэффициент экологической значимости (воздух)</description>
    </items>
    <items>
      <name>КоэффициентЭкологическойЗначимостиОтходы</name>
      <description>Коэффициент экологической значимости (почва)</description>
    </items>
    <items>
      <name>удалитьКоэффициентУчитывающийИнфляцию</name>
      <description>Коэффициент, учитывающий инфляцию</description>
    </items>
  </predefined>
  <attributes>
    <name>Значение</name>
    <type>
      <types>String</types>
      <types>Number</types>
      <numberQualifiers>
        <precision>18</precision>
        <scale>3</scale>
      </numberQualifiers>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

ЛИС2/src/InformationRegisters/ЗначенияКоэффициентов/ЗначенияКоэффициентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЗначенияКоэффициентов</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Значение</name>
    <type>
      <types>String</types>
      <types>Number</types>
      <numberQualifiers>
        <precision>18</precision>
        <scale>3</scale>
      </numberQualifiers>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Коэффициент</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ОКТМО</name>
    <type>
      <types>CatalogRef.ОКТМО</types>
    </type>
  </dimensions>
  <dimensions>
    <name>БассейновыйОкруг</name>
    <type>
      <types>CatalogRef.ВодныеОбъекты</types>
      <types>CatalogRef.ВодохозяйственныеУчастки</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ЛИС2/src/Catalogs/Коэффициенты/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ДополнительныеОтчетыИОбработки
	ДополнительныеОтчетыИОбработки.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ДополнительныеОтчетыИОбработки
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
	
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ЗначенияКоэффициентовСрезПоследних.Период,
			|	ЗначенияКоэффициентовСрезПоследних.Значение
			|ИЗ
			|	РегистрСведений.ЗначенияКоэффициентов.СрезПоследних(, Коэффициент = &Коэффициент) КАК ЗначенияКоэффициентовСрезПоследних";
		
		Запрос.УстановитьПараметр("Коэффициент", Объект.Ссылка);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Если ВыборкаДетальныеЗаписи.Следующий() Тогда

			ДатаТекущегоЗначения = ВыборкаДетальныеЗаписи.Период;
			ТекущееЗначение = ВыборкаДетальныеЗаписи.Значение;
			
		КонецЕсли;

	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)

	ЗаписьРегистраКоэффициентов = РегистрыСведений.ЗначенияКоэффициентов.СоздатьМенеджерЗаписи();
	ЗаписьРегистраКоэффициентов.Период 		= ДатаНовогоЗначения;
	ЗаписьРегистраКоэффициентов.Коэффициент = ТекущийОбъект.Ссылка;
	ЗаписьРегистраКоэффициентов.Значение 	= ТекущийОбъект.Значение;
	ЗаписьРегистраКоэффициентов.Записать();
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Оповестить("ИзменениеЗначенияКоэффициента"); 
	
КонецПроцедуры

#КонецОбласти
